摘录自 [Markdown 语法说明 (简体中文版)](http://wowubuntu.com/markdown/) [献给写作者的 Markdown 新手指南](http://www.jianshu.com/p/q81RER "献给写作者的 Markdown 新手指南")
**Markdown 易读易写，格式美观简单 **
#1.  标题
##1.1 Atx 形式
`#` 和 `标题名` 之间建议保留一个字符的空格(即一个空格)，`#`的标题级别对应`HTML`中的`H1`~`H6`标签 ，一个`#`代表`H1`，依次类推。以选择性地「闭合」`#`。
```
# 一级标题名 #
## 二级标题名
### 三级标题名
#### 四级标题名
##### 五级标题名
###### 六级标题名
```
####例：
##### 这是一个H5 五级标题[闭合式] #####
##### 这是一个H5 五级标题
##1.2 Setext形式
用底线的形式，利用 `=` （最高阶标题）和 `-` （第二阶标题）
```
这是 H1
=============

这是 H2
-------------
```
####例：
这是 H1
=============

这是 H2
-------------

#2.  列表
2.1 无序列表使用星号`*` 、加号`+` 或是减号`-` 作为列表标记。`-`等符号和文本之间要保留一个空格。
2.2 有序列表直接在文本前填写序号和一个空格即可。
```
- 文本1
+ 文本2
* 文本3
```
####例：
- 文本1
+ 文本2
* 文本3

1. 文本1
2. 文本1

#3.  链接和图片
在方块括号后面紧接着圆括号并插入网址链接即可，如果你还想要加上链接的 title 文字，只要在网址后面，用双引号把 title 文字包起来即可。
####链接例：
```
[本文摘录文章之一](http://wowubuntu.com/markdown/ "本文摘录文章之一")
```
[本文摘录文章之一](http://wowubuntu.com/markdown/ "本文摘录文章之一")

####图片例：
```
[![Wiz Icon](http://www.wiz.cn/favicon.ico "Wiz Icon")](http://www.wiz.cn/favicon.ico "Wiz Icon")
```
[![Wiz Icon](http://www.wiz.cn/favicon.ico "Wiz Icon")](http://www.wiz.cn/favicon.ico "Wiz Icon")

#4.  引用区块（Blockquotes）
在每行的最前面加上`>` 。可以嵌套引用（多个`>`叠加）。可以和标题、列表元素一并使用。
```
> 引用的写法
```

> 引用的写法

```
> > 嵌套.
```
> >嵌套.

```
> ## 叠加标题
```
> ### 叠加标题

#5.  强调（粗体和斜体等）
使用星号（`*`）和底线（`_`）作为标记强调字词的符号，被 `*` 或 `_` 包围的字词会被转成用 `<em>` 标签包围，用两个 `*` 或 `_` 包起来的话，则会被转成 `<strong>`。
用两个 `*` 包含一段文本就是粗体的语法，用一个 `*` 包含一段文本就是斜体的语法。
```
*1个强调斜体*
_1个强调斜体_
**2个强调粗体**
__2个强调粗体__
```
####效果：
*1个强调斜体*
_1个强调斜体_
**2个强调粗体**
__2个强调粗体__

#6. 表格

```
| Tables        | Are           | Cool  |
| ------------- |:-------------:| -----:|
| col 3 is      | right-aligned | $1600 |
| col 2 is      | centered      |   $12 |
| zebra stripes | are neat      |    $1 |
```
####效果：
| Tables        | Are           | Cool  |
| ------------- |:-------------:| -----:|
| col 3 is      | right-aligned | $1600 |
| col 2 is      | centered      |   $12 |
| zebra stripes | are neat      |    $1 |
*注意观察对齐的写法*

#7. 分隔线
在一行中用三个以上的星号、减号、底线来建立一个分隔线，行内不能有其他东西。符号中间可插入空格。
```
***
* * *
- - -
___
```
####效果：
***
* * *
- - -
___

#8. 代码

标记一小段行内代码，你可以用反引号把它包起来（```）。
```
java中的关键字 `this`的意义。
```
java中的关键字 `this`的意义。

2016-06-21 22:33:20 星期二 Ken 
